pytrustnfe/nfse/susesu/templates/EnviarNota.xml

<x:Envelope xmlns:x="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://services.nfse">
  <x:Header/>
  <x:Body>
    <EnviarNota xmlns="http://susesu.com.br/">
      <codPrefeitura>{{ codigo_prefeitura }}</codPrefeitura>
      <notaFiscal>
          <![CDATA[
          {% include 'Nota.xml' %}
          ]]>
      </notaFiscal>
      <cnpjPrestador>{{ cnpj_prestador }}</cnpjPrestador>
      <senhaNFD>{{ senha_nfd }}</senhaNFD>
    </EnviarNota>
    </x:Body>
</x:Envelope>
